package chapter3;

public class Ex1 {

	public static void main(String[] args) {
		// 자바에선 소스코드의 최소단위가 클레스임
		/*그래서 이 클래스를 모르면
		 *자바코딩을 할 수 없음
		 *클래스는 연관된 데이터를 묶을수 있게 만들어줌
		 *배열과는 다르게 데이터의 타입 을 고려하지 않음
		 *기본 데이터 타입 외에 나만의 데이터 타입을 만드는 기능
		 *
		 *방법ㅁ
		 *1 클래스 선언
		 *2,인스턴스 생성
		 *3.데이터들 저장
		 *
		 *클래스명{
		 *데이터타입 변수명1;
		 *데이터타입 변수명2;
		 *
		 *데이터타입 면수명
		 *}
		 * */
		
		String[] nameArr = {"김철수","고영희","김성태", "이신혁", "윤경원"};
		int[] ageArr = {16,16,16,16,16,16};
		String[] addrArr = {
				"부산광역시 연제구 연산도",
				"부산광역시 부산진구 부암동",
				"부산광역시 동구 수정동",
				"부산광역시 동구 영주동",
				"부산광역시 남구 우암동"};
		int[] korArr = {51,87,53,79,28};
		
		int[] engArr = {8,76,67,56,87};
		
		int[] matArr = {86,32,34,65,46};
		
		//정수를 저장하기 위한 데이터 타입이 있고
		
		int korScore = 51;
		//정수들을 저장하기 위한 데이터 타입이 있는것 처럼
		int[] korSocres = {51,25};
		//정보를 저장할 수 있는 데이터 타입, 즉 클래스가 있음
		//정보를 저장하기 위한 데이터 타입은 자바가 제공해주지 않음.
		//우리가 직접 만들어야 함.
		
		
		
		
 				
		}
				
	}

}
